class CPlayer;
struct sCurrentStats;
class cGameState;
class sSkillUsage;
class sSkillInfo;
class cSkill;
class CQuestGameManager;
class cQuest;
class cMissionInfo;
class cMission;
class cKGCDropItem;
class cKGCDropManager;
class cDrop;
class cKGCPortal;
class cPortalManager;
class cRoomScene;
class cKGCRoomSceneS6;
class cKGCRoomButtonPanelS6;
class cKD3DButton;
class cGameInput;
class KInput;
class cGameOverlay;
class cKGCGameOverlayUI;
class cSceneList;
class cKGCScene;
class cGameScene;
class sInfinityTime;
class KGCNewNecklaceEnchantDlg;
class cTGInfinityMonsterGen;
class cTriggerChildren;
class CTrigger;
class cTriggerList;
class cStage;
class cKGCUIScene;
class cKGCGrowthMissionDlg;
class cGrowthRewards;
class cGrowthMission;
class cInfinityDungeon;
class cInfinityDungeonInfo;
class sMonsterRankInfo;
class sMonsterLevel;
class sMonsterSpawnInfo;
class CGCGlobal;
class cKGCGlobal;
class SUserInfo;
struct SDungeonInfo;
class cKGCGameBoard;


enum EGCGameMode // GC_GM_*
{
	GC_GM_INVALID = -1,   // invalid game mode value

	GC_GM_TUTORIAL = 0,    // 튜토리얼
	GC_GM_TEAM_MODE = 1,    // 팀 모드
	GC_GM_SURVIVAL_MODE = 2,    // 서바이벌 모드
	GC_GM_TAG_TEAM = 3,    // 태그매치 팀모드
	GC_GM_TAG_SURVIVAL = 4,    // 태그매치 서바이벌
	GC_GM_GUILD_BATTLE = 5,    // 길드전 모드
	GC_GM_INDIGO_TEAM = 6,    // 용사의 섬
	GC_GM_QUEST0 = 7,    // 시련의 숲
	GC_GM_QUEST1 = 8,    // 시련의 탑
	GC_GM_QUEST2 = 9,    // 세르딘성 외곽
	GC_GM_QUEST3 = 10,   // 캐리비치

	GC_GM_MINIGAME_TREEDROP = 33,    // 미니게임 통나무 떨어지기
	GC_GM_MINIGAME_BALLOON = 34,    // 미니게임 풍선 터뜨리기
	GC_GM_MINIGAME_BUTTERFRY = 35,    // 미니게임 나비 잡기
	GC_GM_QUEST22 = 36,   // 소실의협곡
	GC_GM_ANGELS_EGG = 37,    //천사의 알
	GC_GM_CAPTAIN = 38,   // 대장전
	GC_GM_QUEST23 = 39,   // 실버랜드 성난 엔트의 숲
	GC_GM_QUEST24 = 40,   // 실버랜드 실버나이츠
	GC_GM_QUEST25 = 41,    // 실버랜드 미명의 호수
	GC_GM_QUEST26 = 42,    // 제니아 이그니스의 산맥
	GC_GM_QUEST27 = 43,    // 싫버랜드 수룡의 늪
	GC_GM_QUEST28 = 44,    // 실버랜드 원시의 섬
	GC_GM_QUEST29 = 45,    // 실버랜드 드레이크 웜의 영지
	GC_GM_QUEST30 = 46,    // 실버랜드 빅터의 요새
	GC_GM_QUEST31 = 47,    // 제니아 조율의 제단
	GC_GM_QUEST32 = 48,    // 제니아 파괴의신전
	GC_GM_QUEST33 = 49,    // 제니아 생명의숲
	GC_GM_QUEST34 = 50,    // 제니아 지배의 성
	GC_GM_QUEST35 = 51,    // 베르메시아 보스 던전
	GC_GM_QUEST36 = 52,    // 실버랜드 보스 던전
	GC_GM_QUEST37 = 53,    // 엘리아 보스 던전
	GC_GM_QUEST38 = 54,    // 제니아 보스 던전
	GC_GM_QUEST39 = 55,    // 고블린 노역소
	GC_GM_QUEST40 = 56,    // 지하암흑 터널
	GC_GM_QUEST41 = 57,    // 쿵지 쿵지
	GC_GM_QUEST42 = 58,    // 드워프 전초기지
	GC_GM_QUEST43 = 59,    // 신기루 사막
	GC_GM_QUEST44 = 60,    // 드워프 보급로
	GC_GM_QUEST45 = 61,    // 썬더 해머
	GC_GM_QUEST46 = 62,    // 영웅던전 ( 파멸의 성소 )
	GC_GM_QUEST47 = 63,    // 영웅던전 ( 지옥의 용광로 )
	GC_GM_QUEST48 = 64,    // 고대왕국의 흔적
	GC_GM_DOTA = 65,    // 점령전
	GC_GM_AGIT = 66,    // 아지트
	GC_GM_QUEST49 = 67,    // 이벤트 던전 카니발 ( 악몽의 서커스 )
	GC_GM_QUEST50 = 68,    // 이벤트 릴레이 던전 ( 앵그리 보오스 )
	GC_GM_QUEST51 = 69,    // 이벤트 영웅 던전 ( 악몽의 서커스 리뉴얼 )
	GC_GM_QUEST52 = 70,    // 릴레이 영웅 던전 슈퍼 몬스터 ( 환영의 미궁 )
	GC_GM_QUEST53 = 71,	 // 명계열차 301 (GhostTrain)
	GC_GM_QUEST54 = 72,	 // 배고픈 펫들의 반란
	GC_GM_QUEST55 = 73,	 // 카루엘 접경지(KaruelBorder)
	GC_GM_QUEST56 = 74,	 // 카루엘 (Karuel)
	GC_GM_QUEST57 = 75,	 // 이벤트 던전( 야시장 )
	GC_GM_QUEST58 = 76,    // 레이드던전
	GC_GM_AUTOMATCH_TEAM = 77,    // 대전팀 자동매칭
	GC_GM_QUEST59 = 78,    // 사막 도적마을( 아툼 )
	GC_GM_QUEST60 = 79,    // 라 협곡( 아툼 )
	GC_GM_QUEST61 = 80,    // 세트의 피라미드( 아툼 )
	GC_GM_QUEST62 = 81,    // 코우나트 붕괴지( 아케메디아 )
	GC_GM_QUEST63 = 82,    // 코우나트 붕괴지( 이벤트던전 )
	GC_GM_QUEST64 = 83,    // 이벤트 슈팅던전( 탈린의 역습 )

	GC_GM_QUEST65 = 84,    // 아델 신대륙 ( 저주받은 정원 )
	GC_GM_QUEST66 = 85,    // 아델 신대륙 ( 오염된 지하실 )
	GC_GM_QUEST67 = 86,    // 아델 신대륙 ( 망령이 깃든 복도 )
	GC_GM_QUEST68 = 87,    // 아델 신대륙 ( 배신자의 화실 )
	GC_GM_QUEST69 = 88,    // 아델 신대륙 ( 어둠에 물든 서재 )
	GC_GM_QUEST70 = 89,    // 아델 신대륙 ( 아라크네의 둥지 )

	GC_GM_QUEST71 = 90,    // 베이가스 신대륙 ( 골리아스 서식지 )
	GC_GM_QUEST72 = 91,    // 베이가스 신대륙 ( 고대 골렘의 무덤 )
	GC_GM_QUEST73 = 92,    // 베이가스 신대륙 ( 그림자 밀림 )
	GC_GM_QUEST74 = 93,    // 베이가스 신대륙 ( 라세르타의 사냥터 )
	GC_GM_QUEST75 = 94,    // 베이가스 신대륙 ( 절망의 대지 )
	GC_GM_QUEST76 = 95,    // 베이가스 신대륙 ( 차원의 경계 )

	GC_GM_FATAL_DEATH_TEAM = 96,   // 페이탈 데스매치 팀
	GC_GM_FATAL_DEATH_SURVIVAL = 97,   // 페이탈 데스매치 서바이벌

	GC_GM_QUEST77 = 98,	//-- 엘리아 사냥터
	GC_GM_QUEST78 = 99,	//-- 제니아 사냥터 
	GC_GM_QUEST79 = 100,	//-- 아툼 사냥터 
	GC_GM_QUEST80 = 101,	//-- 아케메디아 사냥터
	GC_GM_QUEST81 = 102,	//-- 만렙컨트롤 던전

	NUM_GC_GAME_MODE,
};

template <class T, int thesize>
class KSafeArray
{
private:
	T v[thesize];
public:
	KSafeArray() {}
	~KSafeArray() {}

	// 타입 정의
	typedef T value_type;
	typedef T* iterator;
	typedef const T* const_iterator;
	typedef T& reference;
	typedef const T& const_reference;
	typedef std::size_t size_type;
	typedef std::ptrdiff_t difference_type;

	// 반복자 지원
	iterator begin() { return v; }
	const_iterator begin() const { return v; }
	iterator end() { return v + thesize; }
	const iterator end() const { return v + thesize; }

	// 직접적인 원소 액세스
	reference operator[](std::size_t i) {

		if (i<0 || i >= thesize)
		{
#if defined(DEBUG)
			throw new std::exception("Invalid Index");
#elif !defined( __PATH__ )
			terminate();
#endif
		}

		return v[i];
	}
	const_reference operator[] (std::size_t i) const {

		if (i<0 || i >= thesize)
		{
#if defined(DEBUG)
			throw new std::exception("Invalid Index");
#elif !defined( __PATH__ )
			terminate();
#endif
		}
		return v[i];
	}

	// 사이즈 관련
	size_type size() const { return thesize; }
	size_type max_size() const { return thesize; }

	// 기존 배열로의 전환
	T* as_array() { return v; }
};

class KAttributeInfo
{
public:
	enum ATTRIBUTE_STATE
	{
		ATS_OPENED,
		ATS_USING,
		ATS_CLOSED,
	};

	enum ATTRIBUTE_TYPE
	{
		ATT_UNKNOWN = -1,
	};

	char    m_cSlotID;
	char    m_cType;
	char    m_cState;
	float   m_fValue;
};

class KSocketInfo
{
public:
	enum SOCKET_STATE
	{
		STS_INIT,
		STS_CLOSED,
		STS_OPENED,
		STS_USING,
		STS_BREAK,

		STS_NUM,
	};

	DWORD   m_CardItemID;
	char    m_cSlotID;
	char    m_cState;
};

class KItem
{
public:
	enum ITEM_STATE
	{
		UNLIMITED_ITEM = -1,
		INVALID_ITEM = 0,
	};

	enum ITEM_GRADE
	{
		GRADE_NORMAL = 0,
		GRADE_RARE = 1,
		GRADE_EPIC = 2,
		GRADE_LEGEND = 3,
		GRADE_NUM,
	};

	enum ITEM_TYPE
	{
		TYPE_NORMAL = 0x00000000, // 일반
		TYPE_LOOK = 0x00000001, // 룩(코디)아이템
		TYPE_AGIT_OBJ = 0x00000002, // 아지트 아이템
	};

	enum EItemCharType
	{
		EICT_AGIT = -1,

		EICT_ELESIS = 0,
		EICT_LIRE = 1,
		EICT_ARME = 2,
		EICT_LAS = 3,
		EICT_RYAN = 4,
		EICT_RONAN = 5,
		EICT_AMY = 6,
		EICT_JIN = 7,
		EICT_SIEG = 8,
		EICT_MARI = 9,
		EICT_DIO = 10,
		EICT_ZERO = 11,
		EICT_LEY = 12,
		EICT_LUPUS = 13,
		EICT_RIN = 14,
		EICT_ASIN = 15,
		EICT_LIME = 16,
		EICT_EDEL = 17,
		EICT_BEIGAS = 18,

		EICT_NO_TYPE = 255,
	};

	enum INVEN_TYPE
	{
		INVENTORY = 0,
		DEPOT = -1,
		VIRTUAL_DEPOT = -2, // 실제로 DB에서는 254로 기록 돼 있음. DEPOT이 -1이라서(DB에는 255) 따라감
	};

	DWORD    m_ItemID;
	INT64   m_ItemUID;
	int         m_nCount;
	int         m_nInitCount;
	short       m_sEquipLevel;
	short       m_sEquipLvDown;
	int         m_nPeriod;
	time_t      m_tStartDate;
	time_t      m_tRegDate;
	time_t      m_tEndDate;
	std::vector< KSocketInfo > m_vecSocket;
	std::vector< KAttributeInfo > m_vecAttribute;
	char        m_cItemType;
	INT64   m_EnchantEquipItemUID;
	char        m_cEnchantLevel;
	char        m_cGradeID;
	char        m_cEnchantEquipGradeID;
	DWORD    m_CoordItemID;
	INT64   m_CoordItemUID;
	char        m_cInitInvenType;
	char        m_cInvenType;
	char        m_cCharType;
	char        m_cInitTabID;
	char        m_cTabID;
	char        m_cInitSlotID;
	char        m_cSlotID;
	bool        m_bReserveNewUID;
	DWORD    m_DesignCoordiID;
};

template <typename T>
struct sEncrypt
{
public:
	__int32 dwEncryptId; //0x0000 
	__int32 dwUnknownValue00;
	T Value; //0x0008 
	DWORD dwBaseXor; //0x000C 
	__int32 dwUnknownValue01;
	__int32 dwUnknownValue02;

public:
	T Decrypt()
	{
		DWORD* EncryptTable02 = (DWORD*)EncryptTable00;

		DWORD ConvertedAddy = reinterpret_cast<DWORD>(&Value);

		DWORD EncryptedValue = *(DWORD*)ConvertedAddy;

		EncryptedValue ^= EncryptTable02[2 * dwEncryptId];

		return *(T*)&EncryptedValue;
	}

	void Encrypt(T Value)
	{

		DWORD* EncryptTable02 = (DWORD*)EncryptTable00;

		DWORD ConvertedValue = *(DWORD*)&Value;

		DWORD EncryptedValue = EncryptTable02[2 * dwEncryptId] ^ ConvertedValue;

		this->Value = *(T*)&EncryptedValue;
	}

}; //Size=0x0018

struct sCurrentStats
{
public:
	sEncrypt<float> m_Attack; //0x0000
	sEncrypt<float> m_Def; //0x0018 
	sEncrypt<float> m_MaxHp; //0x0030 
	sEncrypt<float> m_SpAttack; //0x0048 
	sEncrypt<float> m_SpDef; //0x0060 
	sEncrypt<float> m_HpDrain; //0x0078 
	sEncrypt<float> m_MpDrain; //0x0090 
	sEncrypt<float> m_HpRate; //0x00A8 
	sEncrypt<float> m_MpRate; //0x00C0 
	sEncrypt<float> m_CriticalChance; //0x00D8 
	sEncrypt<float> m_CounterDef; //0x00F0 
	sEncrypt<float> m_Rolling; //0x0108 
	sEncrypt<float> m_FastHpRecoveryLimitTime; //0x0120 
	sEncrypt<float> m_IgnoreHaste; //0x0138 
	sEncrypt<float> m_AutoRecoveryHpLimit; //0x0150 
	sEncrypt<float> m_UnknownStatus07; //0x0168 
	sEncrypt<float> m_CriticalDamage; //0x0180 

}; //Size=0x0198


class CMonster
{
public:
	char pad_0x0000[0x4]; //0x0000
	string m_strMonsterName; //0x0004 
	char pad_0x001C[0x14C4]; //0x001C
	__int32 m_iMonsterType; //0x14E0 
	__int32 m_iBossMonster; //0x14E4 
	char pad_0x14E8[0x260]; //0x14E8
	sEncrypt<int> m_AnimationId; //0x1748 
	char pad_0x1760[0x18]; //0x1760
	sEncrypt<float> m_PosX; //0x1778 
	sEncrypt<float> m_PosY; //0x1790 
	char pad_0x17A8[0x58]; //0x17A8
	sEncrypt<float> m_Health; //0x1800 
	char pad_0x1818[0x68]; //0x1818
	sEncrypt<int> m_iLevel; //0x1880 
	char pad_0x1898[0xC8]; //0x1898
	__int32 m_eNPC; //0x1960 
	char pad_0x1964[0x8C]; //0x1964
	__int32 m_iTriggerID; //0x19F0 
	__int32 m_pDropItemObserver; //0x19F4 

}; //Size=0x1D9C

/*
class CMonster
{
public:
	char pad_0x0000[0x1D8]; //0x0000
	DWORD dwMonsterType; //0x01D8 
	DWORD m_iBossMonster; //0x01DC 
	char pad_0x01E0[0x168]; //0x01E0
	sEncrypt<float> m_PosX; //0x0348 
	sEncrypt<float> m_PosY; //0x0360 
	char pad_0x0378[0x150]; //0x0378
	sEncrypt<float> m_Health; //0x04C8 
	char pad_0x04E0[0x38]; //0x04E0
	sEncrypt<DWORD> m_iLevel; //0x0518 
	char pad_0x0530[0x38]; //0x0530
	DWORD m_eNPC; //0x0568 
	char pad_0x056C[0xC]; //0x056C
	float m_fAttackPoint; //0x0578 
	float m_fSummonsAtkRatio; //0x057C 
	float m_fOwnerAtkRatio; //0x0580 
	float m_fHPPoint; //0x0584 
	__int32 m_iMonsterNameID; //0x0588 
	char pad_0x058C[0xC]; //0x058C
	wstring m_strMonsterName; //0x0598 
	char pad_0x05B0[0xE8]; //0x05B0
	DWORD m_iTriggerID; //0x0698 
	char pad_0x069C[0x15C]; //0x069C
	DWORD m_iSummonned; //0x07F8 
	char pad_0x07FC[0xD8]; //0x07FC

}; //Size=0x08D4
*/


class cMonsterManager
{
public:
	map <DWORD, CMonster*> m_mapMonster;
};


class sSkillUsage
{
public:
	DWORD dwSkillId;
	DWORD dwCount;
}; //Size=0x0008

class cGameState
{
public:
	char pad_0x0000[0x10]; //0x0000
	sEncrypt<int> m_CurrentState;


}; //Size=0x0040

class sSkillInfo
{
public:
	__int32 dwSkillId; //0x0000 
	char pad_0x0004[0x4]; //0x0004
	sEncrypt<float> m_Cooldown; //0x0008 
	char pad_0x0020[0x10]; //0x0020

}; //Size=0x0030

class cSkill
{
public:
	sSkillInfo SkillIInfo[6]; //0x0000 
	char pad_0x0090[0x8]; //0x0090

}; //Size=0x0098

#pragma pack(push)
#pragma pack(1)
class SUserInfo
{
public:
	DWORD dwUID; //0x0000 
	wstring strLogin; //0x0004  wstring 
	wstring strNickName; //0x001C 
	wstring strNation; //0x0034 
	DWORD eGCUserLevel; //0x004C 
	unsigned char iAge; //0x0050 
	unsigned char bMan; //0x0051 
	unsigned char cCharIndex; //0x0052 
	char pad_0x0053[0x8E]; //0x0053
	unsigned char iTeam; //0x00E1 
	__int8 bHost; //0x00E2 
	unsigned char bLive; //0x00E3 
	__int32 iGP; //0x00E4 
	char pad_0x00E8[0x10]; //0x00E8

}; //Size=0x019C

class cKGCGlobal
{
public:
	char pad_0x0000[0x1C]; //0x0000
	unsigned char m_bNewUser_Tutorial; //0x001C 
	unsigned char m_bNewUser_Quest; //0x001D 
	char pad_0x001E[0x1A]; //0x001E
	sEncrypt<BOOL> m_bCheckChangedKOM; //0x0038 BOOL 
	char pad_0x0050[0x7C]; //0x0050
	SUserInfo m_kUserInfo; //0x00CC 
	char pad_0x0268[0x784]; //0x0268

}; //Size=0x09EC
#pragma pack(pop)

class CPlayer
{
public:
	char pad_0x0000[0xD08]; //0x0000
	sCurrentStats m_CurrentStatus; //0x0D08 
	char pad_0x0EA0[0x890]; //0x0EA0
	SUserInfo m_UserInfo; //0x1730 
	sEncrypt<int> m_PlayerState; //0x1828 0 In Room, 1 Ready, 2 In Game 
	char pad_0x1840[0x86A0]; //0x1840
	D3DXVECTOR2 m_vPosition; //0x9EE0 
	char pad_0x9EE8[0x2AC]; //0x9EE8
	map<int, sSkillUsage*> m_mapSkillUsage; //0xA194 map<int, sSkillUsage>
	vector<sSkillInfo*> m_vSkillInfo; //0xA19C vector<sSkillInfo> 
	char pad_0xA1A8[0x108]; //0xA1A8
	DWORD m_iControlInfoComboCount; //0xA2B0 
	DWORD m_iControlInfoBackAttackCount; //0xA2B4 
	DWORD m_iControlInfoBeAttackedCount; //0xA2B8 
	DWORD m_iControlInfoRank; //0xA2BC 
	char pad_0xA2C0[0xC34]; //0xA2C0

}; //Size=0xAEF4

/*
class CPlayer
{
public:
	char pad_0x0000[0x414]; //0x0000
	DWORD dwUID; // 0x0414;
	wstring wszLogin; //0x0418 
	wstring wszName; //0x0430 
	wstring wszCountry; //0x0448 
	char pad_0x0460[0xAC]; //0x0460
	sEncrypt<int> m_PlayerState; //0x050C 0 In Room, 1 Ready, 2 In Game 
	char pad_0x0524[0x4754]; //0x0524
	sEncrypt<int> m_CharacterId; //0x4C78 
	char pad_0x4C90[0x11F0]; //0x4C90
	sCurrentStats m_CurrentStatus; //0x5E80 
	char pad_0x6018[0x2C48]; //0x6018
	D3DXVECTOR2 m_vPosition; //0x8C60 
	char pad_0x8C68[0x2A0]; //0x8C68
	map<int, sSkillUsage> m_mapSkillUsage; //0x8F08 map<int, sSkillUsage>
	cSkill* pSkill; //0x8F10 
	char pad_0x8F14[0x10C]; //0x8F14
	DWORD m_iControlInfoComboCount; //0x9020 
	DWORD m_iControlInfoBackAttackCount; //0x9024 
	DWORD m_iControlInfoBeAttackedCount; //0x9028 
	DWORD m_iControlInfoRank; //0x902C 
	char pad_0x9030[0xC34]; //0x9030

}; //Size=0x9C64
*/

class cQuest
{
public:
	CQuestGameManager* pQuestGameManager; //0x0000 
	char pad_0x0004[0x40]; //0x0004

}; //Size=0x0044

class CQuestGameManager
{
public:
	char pad_0x0000[0x28]; //0x0000
	__int32 m_iBeforeDirection; //0x0028 
	__int32 m_iCurStage; //0x002C 
	DWORD m_iCurTileX; //0x0030 
	DWORD m_iCurTileY; //0x0034 
	__int32 m_iBossStageNum; //0x0038 
	unsigned char m_bQuestStarted; //0x003C 
	unsigned char m_bWin; //0x003D 
	unsigned char m_bEndGame; //0x003E 
	unsigned char m_bClearStage; //0x003F 
	unsigned char m_bLoading; //0x0040 
	char pad_0x0041[0x3]; //0x0041
	DWORD m_dwEndGameDelay; //0x0044 
	unsigned char m_bDramaStage; //0x0048 
	char pad_0x0049[0x7]; //0x0049
	DWORD m_dwPlayFrame; //0x0050 
	unsigned char m_bShowStartMsg; //0x0054 
	unsigned char m_bPerfectMode; //0x0055 
	unsigned char m_bMonLoadComplete; //0x0056 
	char pad_0x0057[0x1]; //0x0057
	__int32 m_iMonsterNum; //0x0058 
	char pad_0x005C[0x64]; //0x005C
	unsigned char m_bSendGetEndGameInfo; //0x00C0 
	unsigned char m_bGetEndGameInfo; //0x00C1 
	char pad_0x00C2[0x2]; //0x00C2
	__int32 m_dwEndGameInfoDelayTime; //0x00C4 
	char pad_0x00C8[0x8]; //0x00C8
	unsigned char m_bSendRouletteList; //0x00D0 
	unsigned char m_bRouletteList; //0x00D1 
	char pad_0x00D2[0x6]; //0x00D2
	__int32 m_dwRouletteWaitDelay; //0x00D8 
	char pad_0x00DC[0x16C]; //0x00DC
	std::map< std::pair<int, int>, bool >  m_mapStageHistory; //0x0248 std::map< std::pair<int, int>, bool > 
	char pad_0x0250[0x18]; //0x0250
	DWORD m_iCurDialoge; //0x0268 
	unsigned char m_bMovement; //0x026C 
	char pad_0x026D[0x8B]; //0x026D
	sEncrypt<float> m_fRankPoint; //0x02F8 
	sEncrypt<int> m_MaxCombo; //0x0310 
	sEncrypt<int> m_MaxComboDamage; //0x0328 
	sEncrypt<int> m_ComboDamage; //0x0340 
	sEncrypt<int> m_TotalDamageFromMonster; //0x0358 
	sEncrypt<int> m_TotalBackPlusAerialAttack; //0x0370 
	sEncrypt<int> m_KillCombo; //0x0388 
	sEncrypt<int> m_MaxKillCombo; //0x03A0 
	sEncrypt<int> m_BossKillCombo; //0x03B8 
	sEncrypt<float> fTotalDamage; //0x03D0 
	sEncrypt<int> m_InfinityDungeonPartyRank; //0x03E8 
	sEncrypt<int> m_InfinityDungeonMonsterLevel; //0x0400 
	unsigned char m_bExistMonsterInScreen; //0x0418 
	unsigned char m_bPortalInScreen; //0x0419 
	char pad_0x041A[0x5A]; //0x041A
	DWORD m_iHeroDungeonLevel; //0x0474 
	DWORD m_iPlayersAveLv; //0x0478 
	unsigned char m_ucPlayerNum; //0x047C 
	unsigned char m_bRankPortalCheck; //0x047D 
	unsigned char m_bComboBreak; //0x047E 
	char pad_0x047F[0x31]; //0x047F

}; //Size=0x04B0

/*
class CQuestGameManager
{
public:
	char pad_0x0000[0x24]; //0x0000
	__int32 m_iBeforeDirection; //0x0024 
	__int32 m_iCurStage; //0x0028 
	DWORD m_iCurTileX; //0x002C 
	DWORD m_iCurTileY; //0x0030 
	__int32 m_iBossStageNum; //0x0034 
	unsigned char m_bQuestStarted; //0x0038 
	unsigned char m_bWin; //0x0039 
	unsigned char m_bEndGame; //0x003A 
	unsigned char m_bClearStage; //0x003B 
	unsigned char m_bLoading; //0x003C 
	char pad_0x003D[0x3]; //0x003D
	DWORD m_dwEndGameDelay; //0x0040 
	unsigned char m_bDramaStage; //0x0044 
	char pad_0x0045[0x3]; //0x0045
	DWORD m_dwPlayFrame; //0x0048 
	unsigned char m_bShowStartMsg; //0x004C 
	unsigned char m_bPerfectMode; //0x004D 
	unsigned char m_bMonLoadComplete; //0x004E 
	char pad_0x004F[0x1]; //0x004F
	__int32 m_iMonsterNum; //0x0050 
	__int8 m_bIsHackedDungeon; //0x0054 
	unsigned char m_bIsMonsterHPHack; //0x0055 
	unsigned char m_bIsAttackedMon; //0x0056 
	unsigned char m_bBossStage; //0x0057 
	DWORD m_iCurMonsterNum; //0x0058 
	std::vector<std::vector<float>>  m_vecCurAtk; //0x005C  std::vector<std::vector<float>>
	std::vector<std::vector<float>>  m_vecIncAtkRatio; //0x0068  std::vector<std::vector<float>> 
	char pad_0x0074[0x44]; //0x0074
	unsigned char m_bSendGetEndGameInfo; //0x00B8 
	unsigned char m_bGetEndGameInfo; //0x00B9 
	char pad_0x00BA[0x2]; //0x00BA
	__int32 m_dwEndGameInfoDelayTime; //0x00BC 
	char pad_0x00C0[0xC]; //0x00C0
	unsigned char m_bSendRouletteList; //0x00CC 
	unsigned char m_bRouletteList; //0x00CD 
	char pad_0x00CE[0x2]; //0x00CE
	__int32 m_dwRouletteWaitDelay; //0x00D0 
	char pad_0x00D4[0x170]; //0x00D4
	std::map< std::pair<int, int>, bool > m_mapStageHistory; //0x0244 std::map< std::pair<int, int>, bool > 
	char pad_0x024C[0x18]; //0x024C
	DWORD m_iCurDialoge; //0x0264 
	unsigned char m_bMovement; //0x0268 
	char pad_0x0269[0x7]; //0x0269
	D3DXVECTOR2 m_vecArena; //0x0270 
	__int32 m_iMaxStage; //0x0278 
	__int32 m_iAllLevelMaxStage; //0x027C 
	DWORD m_iComboBreakCount; //0x0280 
	char pad_0x0284[0x1C]; //0x0284
	sEncrypt<float> m_fRankPoint; //0x02A0 
	sEncrypt<int> m_MaxCombo; //0x02B8 
	sEncrypt<int> m_MaxComboDamage; //0x02D0 
	sEncrypt<int> m_ComboDamage; //0x02E8 
	sEncrypt<int> m_TotalDamageFromMonster; //0x0300 
	sEncrypt<int> m_TotalBackPlusAerialAttack; //0x0318 
	sEncrypt<int> m_KillCombo; //0x0330 
	sEncrypt<int> m_MaxKillCombo; //0x0348 
	sEncrypt<int> m_BossKillCombo; //0x0360 
	sEncrypt<float> fTotalDamage; //0x0378 
	sEncrypt<int> m_InfinityDungeonPartyRank; //0x0390 
	sEncrypt<int> m_InfinityDungeonMonsterLevel; //0x03A8 
	unsigned char m_bExistMonsterInScreen; //0x03C0 
	unsigned char m_bPortalInScreen; //0x03C1 
	char pad_0x03C2[0x5A]; //0x03C2
	DWORD m_iHeroDungeonLevel; //0x041C 
	DWORD m_iPlayersAveLv; //0x0420 
	unsigned char m_ucPlayerNum; //0x0424 
	unsigned char m_bRankPortalCheck; //0x0425 
	unsigned char m_bComboBreak; //0x0426 
	char pad_0x0427[0x31]; //0x0427

}; //Size=0x0458
*/


class sPlayer_Work
{
public:
	unsigned char IsLive; //0x0000 
	unsigned char IsLevelUp; //0x0001 
	char pad_0x0002[0x2]; //0x0002
	__int32 IsSPLevelUp; //0x0004 
	float fGuildPointPercent; //0x0008 
	char pad_0x000C[0x8]; //0x000C
	DWORD Start_Score; //0x0014 
	sEncrypt<int> How_Kill; //0x0018 
	__int32 How_Die; //0x0030 
	unsigned char IsWin; //0x0034 
	char pad_0x0035[0x3]; //0x0035
	__int32 m_iChar; //0x0038 
	__int32 dwUID; //0x003C 
	char pad_0x0040[0x18]; //0x0040

}; //Size=0x0058



class cMission
{
public:
	cKGCGameBoard* pMissionInfo; //0x0000 
	char pad_0x0004[0x3C]; //0x0004

}; //Size=0x0040

class cKGCGameBoard
{
public:
	std::vector< int >  m_vtMonKillTGID; //0x0000 std::vector< int >  
	std::map< int, unsigned short > m_mapMonKillNum; //0x000C 
	std::map< int, unsigned short > m_mapMonNum; //0x0014 
	char pad_0x001C[0x94]; //0x001C
	sEncrypt<int> m_GameTime; //0x00B0 
	char pad_0x00C8[0x30]; //0x00C8
	__int32 m_iAttackCount; //0x00F8 
	char pad_0x00FC[0x4]; //0x00FC
	sPlayer_Work m_pStartingMember[6]; //0x0100 
	char pad_0x0310[0x40]; //0x0310

}; //Size=0x0350

class cDrop
{
public:
	cKGCDropManager* pDropManager; //0x0000 
	char pad_0x0004[0x60]; //0x0004

}; //Size=0x0064


class cKGCDropManager
{
public:
	char pad_0x0000[0x14]; //0x0000
	map<DWORD, cKGCDropItem*> m_mapItemDrop; //0x0014 
	char pad_0x001C[0x8]; //0x001C
	map<DWORD, cKGCDropItem*> m_mapGpDrop; //0x0024 
	char pad_0x002C[0x6C]; //0x002C
	std::set< DWORD> m_setGetGP; //0x0098 std::set< DWORD>
	std::map< DWORD, DWORD > m_mapGetItem; //0x00A0 std::map< DWORD, DWORD >

}; //Size=0x0084

class cKGCDropItem
{
public:
	char pad_0x0000[0x8]; //0x0000
	__int32 m_iTriggerID; //0x0008 
	DWORD m_dwDropUID; //0x000C 
	DWORD m_dwUserUID; //0x0010 
	__int32 m_iOwnerIndex; //0x0014 
	unsigned char m_cDropType; //0x0018 
	char pad_0x0019[0x3]; //0x0019
	__int32 m_dwGoodsID; //0x001C 
	DWORD m_iDuration; //0x0020 
	DWORD m_iMonID; //0x0024 
	DWORD m_iStageCountType; //0x0028 
	DWORD m_iState; //0x002C 
	DWORD m_iTime; //0x0030 
	char pad_0x0034[0x4]; //0x0034
	D3DXVECTOR2 m_vPos; //0x0038 
	char pad_0x0040[0x58]; //0x0040
	wstring m_strName; //0x0098 
	char pad_0x00B0[0x5C]; //0x00B0

}; //Size=0x010C

/*
class cKGCDropItem
{
public:
	char pad_0x0000[0x1C]; //0x0000
	DWORD dwId; //0x001C 
	char pad_0x0020[0xC]; //0x0020
	DWORD dwDropItem; //0x002c
	DWORD dwElapseTime; //0x0030 
	char pad_0x0034[0x4]; //0x0034
	D3DXVECTOR2 m_vPos; //0x0038 
	char pad_0x0040[0x58]; //0x0040
	wstring szName; //0x0098 wstring 
	char pad_0x00B0[0x54]; //0x00B0

}; //Size=0x0104
*/

class cKGCPortal
{
public:
	char pad_0x0000[0x8]; //0x0000
	D3DXVECTOR2 m_vPos; //0x0008 
	char pad_0x0010[0xC]; //0x0010
	__int8 m_bIsOpen; //0x001C 
	char pad_0x001D[0x7]; //0x001D
	__int32 dwPortalCode; //0x0024 
	char pad_0x0028[0xC]; //0x0028
	DWORD dwPortalFlag; //0x0034 
	DWORD dwDirection; //0x0038 
	char pad_0x003C[0x404]; //0x003C

}; //Size=0x0440


class cPortalManager
{
public:
	std::map <cKGCPortal*, DWORD> m_mapPortal;

}; //Size=0x0040




class cRoomScene
{
public:
	cKGCRoomSceneS6* pRoomSceneS6; //0x0000 
	char pad_0x0004[0x3C]; //0x0004

}; //Size=0x0040


class cKGCRoomSceneS6
{
public:
	char pad_0x0000[0x408]; //0x0000
	cKGCRoomButtonPanelS6* pRoomButtonPanelS6; //0x0408 
	char pad_0x040C[0x7FC]; //0x040C

}; //Size=0x0C08


class cKGCRoomButtonPanelS6
{
public:
	char pad_0x0000[0x344]; //0x0000
	cKD3DButton* pStartButton; //0x0344 
	char pad_0x0348[0x4]; //0x0348

}; //Size=0x034C


class cKD3DButton
{
public:
	char pad_0x0000[0xC]; //0x0000
	char* szName; //0x000C 
	char pad_0x0010[0x130]; //0x0010
	D3DXVECTOR2 m_vPosition; //0x0140 
	char pad_0x0148[0x3C]; //0x0148

}; //Size=0x0184


class cGameScene
{
public:
	cKGCScene* pCurrentScene; //0x0000 

}; //Size=0x0040

class cKGCScene
{
public:
	char pad_0x0000[0xC]; //0x0000
	__int32 dwId; //0x000C 
	char pad_0x0010[0x4]; //0x0010
	string szName; //0x0014 
	char pad_0x002C[0x3C]; //0x002C
	cKGCUIScene* pUIScene; //0x0068 
	char pad_0x006C[0x4]; //0x006C
	std::vector<cKGCScene*> m_vChildren; //0x0070 
	char pad_0x007C[0x2BC]; //0x007C

}; //Size=0x0338


class cSceneList
{
public:
	cKGCScene* pChild[15]; //0x0000 

}; //Size=0x07A8

class cKGCUIScene
{
public:
	char pad_0x0000[0x4]; //0x0000
	string szName; //0x0004 
	char pad_0x001C[0x4C]; //0x001C
	cKGCScene* pCurrentUI; //0x0068
	char pad_0x006C[0x2D4]; //0x006C
	KGCNewNecklaceEnchantDlg* pGCNewNecklaceEnchantDlg; //0x0340 
	char pad_0x0344[0x1C]; //0x0344

}; //Size=0x0360


class cKGCGrowthMissionDlg : public cKGCScene
{
public:
	char pad_0x0330[0xC]; //0x0330
	cGrowthRewards* pGrowthRewards; //0x033C 
	char pad_0x0340[0x28]; //0x0340

}; //Size=0x0368


class cGrowthRewards
{
public:
	cGrowthMission* pReward[21]; //0x0000 

}; //Size=0x0084

class cGrowthMission
{
public:
	__int32 dwID; //0x0000 
	__int32 dwPrevID; //0x0004 
	string szName; //0x0008 
	__int32 dwGoal; //0x0020 
	DWORD dwVP; //0x0024 
	DWORD dwRewardId; //0x0028 
	DWORD dwRewardQuantity; //0x002C 
	__int32 dwToolTip; //0x0030 

}; //Size=0x0034

class cGameInput
{
public:
	KInput* cInput; //0x0000 
	char pad_0x0004[0x3C]; //0x0004

}; //Size=0x0040

class KInput
{
public:
	char pad_0x0000[0x110]; //0x0000
	__int32 dwRightMouse; //0x0110 
	char pad_0x0114[0x114]; //0x0114
	__int8 RightMouse; //0x0228 
	char pad_0x0229[0x5DB]; //0x0229

}; //Size=0x0804

class cGameOverlay
{
public:
	cKGCGameOverlayUI* pGameOverlayUI; //0x0000 
	char pad_0x0004[0x9C]; //0x0004

}; //Size=0x00A0

class cKGCGameOverlayUI
{
public:
	char pad_0x0000[0x474]; //0x0000
	unsigned char bIsShowDialogue; //0x0474 

}; //Size=0x0484

class CEveryTriggerManager
{
public:
	char pad_0x0000[0x10]; //0x0000
	std::vector<CTrigger*> m_vtActiveTrigger; //0x0010 
	char pad_0x001C[0x1C]; //0x001C
	string szRenderStage; //0x0038 
	sEncrypt<int> m_RenderStage; //0x0050 
	char pad_0x0068[0x10]; //0x0068
	string szStage; //0x0078 
	sEncrypt<int> m_Stage; //0x0090 
	char pad_0x00A8[0x440]; //0x00A8

}; //Size=0x04E8

class cTriggerList
{
public:
	CTrigger* pTrigger; //0x0000 
	char pad_0x0004[0x20]; //0x0004

}; //Size=0x0024

class CTrigger
{
public:
	char pad_0x0000[0x18]; //0x0000
	string szName; //0x0018 
	cTriggerChildren* pChildren; //0x0030 
	char pad_0x0034[0x50]; //0x0034

}; //Size=0x0084


class cTriggerChildren
{
public:
	char pad_0x0000[0x4]; //0x0000
	cTGInfinityMonsterGen* pInfinityMonsterGen; //0x0004 
	char pad_0x0008[0x40]; //0x0008

}; //Size=0x0048


class sInfinityTime
{
public:
	DWORD dwMax; //0x0000 
	DWORD dwCurrent; //0x0004 

}; //Size=0x0008

class cTGInfinityMonsterGen
{
public:
	char pad_0x0000[0x18]; //0x0000
	sInfinityTime m_MobSpawn; //0x0018 
	char pad_0x0020[0x4]; //0x0020
	sInfinityTime m_CommonBoss; //0x0024 
	sInfinityTime m_BestBoss; //0x002C 
	sInfinityTime m_WaitBoss; //0x0034 
	sInfinityTime m_RestartSpawn; //0x003C 
	unsigned char bSpawn; //0x0044 
	unsigned char bIsSpawnFreezed; //0x0045 
	unsigned char bShowPortalMsg; //0x0046 
	unsigned char bIsSpawnFreezedByBoss; //0x0047 
	char pad_0x0048[0x40]; //0x0048

}; //Size=0x0088

class cItemInfo
{
public:
	wstring szName; //0x0000 
	char pad_0x0018[0x18]; //0x0018
	DWORD dwId; //0x0030 
	char pad_0x0034[0xC]; //0x0034
	DWORD dwLevel; //0x0040 
	char pad_0x0044[0x4]; //0x0044
	DWORD dwStatus; //0x0048 
	char pad_0x004C[0x28]; //0x004C
	DWORD dwSellPrice; //0x0074 
	char pad_0x0078[0x68]; //0x0078

}; //Size=0x00E0


class cKCItemManager
{
public:
	char pad_0x0000[0xA0]; //0x0000
	std::map<DWORD, KItem*> ItemList; //0x00A0 
	char pad_0x00A8[0x4C]; //0x00A8
	stdext::hash_map<DWORD, cItemInfo*> m_mapDB; //0x00F0 
	char pad_0x0114[0xD0]; //0x0114

}; //Size=0x01E4


class cItemManager
{
public:
	cKCItemManager* Manager; //0x0000 
	char pad_0x0004[0x8]; //0x0004

}; //Size=0x000C

template <typename T>
class sData
{
public:
	T Value[20]; //0x0000 

}; //Size=0x0004

template <typename T>
class sLuaVector
{
public:
	int GetSize()
	{
		return  (dwLength - (DWORD)Data) / 4;
	}

	sData<T>* Data; //0x0000 
	DWORD dwLength; //0x0004 
	char pad_0x0008[0x4]; //0x0008

}; //Size=0x000C

class cInfinityDungeon
{
public:
	map<DWORD, cInfinityDungeonInfo> m_mapInfintyDungeon; //0x0000 cInfinityDungeonInfo
	char pad_0x0004[0x10]; //0x0004
	__int32 dwWaveSpawned; //0x0014 

}; //Size=0x0084

class cInfinityDungeonInfo
{
public:
	DWORD dwDungeonId; //0x0000 
	char pad_0x0004[0x18]; //0x0004
	DWORD dwBossRegenRank; //0x001C 
	DWORD dwRegenWaitTime; //0x0020 
	DWORD dwMinBossRegenTime; //0x0024 
	DWORD dwMaxBossRegenTime; //0x0028 
	map<DWORD, sMonsterRankInfo> m_mapMonsterRank; //0x002C  map<DWORD,sMonsterRank>
	DWORD dwMonsterRegenTime; //0x0034 
	DWORD dwStartMonsterLevel; //0x0038 
	sLuaVector<DWORD> m_MonsterQuantity; //0x003C 
	sLuaVector<DWORD> m_StartMonsterSpawn; //0x0048 
	map <DWORD, sMonsterSpawnInfo> m_mapMonsterSpawnInfo; //0x0054  sMonsterSpawnInfo

}; //Size=0x005C


class sMonsterRankInfo
{
public:
	DWORD dwRank; //0x0000 
	DWORD dwLevel; //0x0004 

}; //Size=0x0008

class sMonsterSpawnInfo
{
public:
	DWORD dwIndex; //0x0000 
	DWORD dwLevel; //0x0004 
	sLuaVector<DWORD> m_Rank; //0x0008 
	sLuaVector<DWORD> m_Monster; //0x0014 

}; //Size=0x0024

class KGCNewNecklaceEnchantDlg : public cKGCScene
{
public:
	char pad_0x0338[0x2C]; //0x0338
	DWORD m_ItemID; //0x0364 
	DWORD m_ItemUID; //0x0368 
	DWORD m_AssistID; //0x036C 
	DWORD nMaterial; //0x0370 
	DWORD nLevel; //0x0374 
	DWORD m_Result; //0x0378 
	DWORD m_Count; //0x037C 
	char pad_0x0380[0x38]; //0x0380

}; //Size=0x03B8


enum EM_DUNGEON_TYPE
{
	DUNGEON_TYPE_INVALID = -1,
	DUNGEON_TYPE_NORMAL = 0,
	DUNGEON_TYPE_HERO = 1,
	DUNGEON_TYPE_EVENT = 2,
	DUNGEON_TYPE_RELAY_HERO = 3,
	DUNGEON_TYPE_RAID_HERO = 4,
	DUNGEON_TYPE_INFINITY = 5,
};

struct SDungeonInfo
{
	EGCGameMode         m_emGameMode;       //  게임모드 ( 던전 Flag ) 
	std::string         m_strLoadingImg;    // 로딩 파일 이름 
	int                 m_nLimitLevel;     //  던전 난이도 ( 노멀 1, 어려움 2, 매우어려움 3 ) 
	bool                m_bHellMode;        //  헬모드 여부
	EM_DUNGEON_TYPE     m_emDungeonType;    //  던전 타입
	int                 m_nDungeonName;     //  던전 이름 스트링 넘버
	int                 m_nWorldMapName;    //  월드맵 이름 스트링 넘버
	bool                m_bShowPlayTime;  // 플레이 타임 출력여부
	bool                m_bShowRank;  // 랭크UI 출력여부
	bool                m_bShowTodayTip;  // 오늘의 팁 출력여부
	bool                m_bComboEffect;  // 콤보이펙트 출력여부
	bool                m_bUseGameItem;    // 게임아이템 사용여부
	bool                m_bUsePetSkill;    // 펫 필살기 사용여부
	bool                m_bNoRecoveryMode; // MP자동회복 금지모드
	int                 m_nMaxPlayerNum;    // 던전 플레이 인원
	int                 m_iCharLife;    // 던전 기본 Life
};

class cKGCWorldManager
{
public:
	std::map<EGCGameMode, SDungeonInfo> m_mapDungeonInfo; //0x0000
	char pad_0x0008[0x20]; //0x0008
	DWORD m_eCurrentWorldMap; //0x0028 
	DWORD m_iCurrentSelectDungeon; //0x002C 
	char pad_0x0030[0x3D4]; //0x0030

}; //Size=0x0404


struct KCharacterStats
{
public:
	enum MODE_TYPE {
		MT_DUNGEON = 0,
		MT_TEAM,
		MT_SURVIVAL,
	};

	int     m_nAccCount;  // 플레이 횟수
	int     m_nModeType;  // 모드 타입
};

#define DECL_DATA(p) struct p

DECL_DATA(KCharacterExpInfo)
{
	char                m_cCharType;
	int                 m_nBaseExp; // 게임후 기본적으로 받는 경험치;
	int                 m_nTotalRecvExp;
	std::map<int, float> m_mapExpBoost;
	std::map<int, float> m_mapSpxBoost;
	int                 m_nAdditionnalExp;
	DWORD               m_dwTotalRecvSpx;;
	char                m_cCharJob;
	void Clear()
	{
		m_nBaseExp = 0;
		m_nTotalRecvExp = 0;
		m_mapExpBoost.clear();
		m_mapSpxBoost.clear();
		m_nAdditionnalExp = 0;
		m_dwTotalRecvSpx = 0;
	}
};

DECL_DATA(KKillCoinInfo)
{
	DWORD   m_dwUserUID;
	char    m_cCharType;
	int     m_nCoin;
};

DECL_DATA(KHackData)
{
	std::vector<float>  m_vecAtkData;       // 클라이언트 공격력 값(스테이지 클리어 개수만큼)
